trade_exp/src/InformationRegisters/ФискальныеОперации/ФискальныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3c1c25ab-8458-4f2b-8485-6471eb235795">
  <name>ФискальныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="e21067d4-d826-4375-acba-7c91efebe502">
    <name>НомерЧекаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ffef034-2cf3-4222-a352-89b4651cc518">
    <name>ЗаводскойНомерФН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a3caeb0f-e2f9-4f6b-acc0-f3ea296568ee">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="22e8c38f-f3e2-42f4-9d67-6271cfd319b2">
    <name>ТипРасчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="1c1cc187-8275-4180-a5c6-7f9a0f455259">
    <name>ТипДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d8c7ed5d-426c-4a9a-a68a-d51bdff35784">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="02df977e-c46a-4795-be55-0bdd43dbbc0e">
    <name>ДокументРодитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="08024dfb-e166-4d0d-a97d-da967d88f819">
    <name>ФискальныйПризнак</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="84cc7c8d-7e84-4a02-97dd-d7aa83817ebc">
    <name>НомерСменыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ad03ef28-0be0-4f8a-8912-dc9050b23247">
    <name>ДополнительныйРеквизит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="a3459d86-ce94-4244-9541-e8c0ebaf1d8c">
    <name>ИдентификаторЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="85c311f9-eaa5-4f91-8d8d-7385bfb79031">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/CommonModules/ОперацияПоПлатежнойКартеЛокализация/Module.bsl
#Область СлужебныеПроцедурыИФункции
&ИзменениеИКонтроль("РазрешеноПробитиеФискальныхЧековПоДокументу")
Функция Док_РазрешеноПробитиеФискальныхЧековПоДокументу(Форма) Экспорт

	РазрешеноПробитиеФискальныхЧековПоДокументу = Истина;

	Объект                  = Форма.Объект;
	#Удаление
	СпособПроведенияПлатежа = Форма.СпособПроведенияПлатежа;	
	#КонецУдаления
	#Вставка
	Попытка
	СпособПроведенияПлатежа = Форма.СпособПроведенияПлатежа;
	Исключение
	СпособПроведенияПлатежа = Неопределено;	
	КонецПопытки;
	#КонецВставки
	Если СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.ИнтернетЭквайринг Тогда

		ФискальныеЧекиФормируетПлатежнаяСистема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.ДоговорЭквайринга,
			"ФискальныеЧекиФормируетПлатежнаяСистема");

		РазрешеноПробитиеФискальныхЧековПоДокументу = НЕ ФискальныеЧекиФормируетПлатежнаяСистема;

	КонецЕсли;

	Возврат РазрешеноПробитиеФискальныхЧековПоДокументу;

КонецФункции

&ИзменениеИКонтроль("ОбновитьГиперссылкуПробитияФискальногоЧека")
Процедура Док_ОбновитьГиперссылкуПробитияФискальногоЧека(ДокументСсылка, Форма, МассивПредставлений) Экспорт
	
	Объект = Форма.Объект;
	
	ФискальнаяОперацияДанныеЖурнала = ФормированиеФискальныхЧековСервер.ДанныеПробитогоФискальногоЧекаПоДокументу(ДокументСсылка);
	ФискальнаяОперацияПодключенноеОборудование = ПодключаемоеОборудованиеУТВызовСервера.ОборудованиеПодключенноеКТерминалу(Объект.ЭквайринговыйТерминал);
	
	Если Форма.СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.ИнтернетЭквайринг
		И ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		
		ФискальныеЧекиФормируетПлатежнаяСистема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Объект.ДоговорЭквайринга,
			"ФискальныеЧекиФормируетПлатежнаяСистема");
		
		Если ФискальныеЧекиФормируетПлатежнаяСистема Тогда
			Возврат;
		КонецЕсли;
		
		Если ФормированиеФискальныхЧековСервер.ЕстьПодключенноеОборудованиеККассамОрганизации(Объект.Организация) Тогда
			
			ТекстСсылки = "ПробитьЧек";
			ТекстПредставления = НСтр("ru = 'Пробить чек'");
			Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
				ТекстПредставления = НСтр("ru = 'Пробить чек'");
			КонецЕсли;
			
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиКомандуПробитьЧек(МассивПредставлений, ТекстСсылки, ТекстПредставления);
		Иначе
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиСтатусЧекНеПробит(МассивПредставлений, "НастроитьОборудование");
		КонецЕсли;
	
	ИначеЕсли НЕ Объект.ОплатаВыполнена
		И ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		
		СпособПроведенияПлатежа = Форма.СпособПроведенияПлатежа;
		
		Если СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.ЭквайринговыйТерминал
			И (ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.Терминал) 
				Или ФискальнаяОперацияПодключенноеОборудование.ИспользоватьБезПодключенияОборудования = Истина)
			И ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.ККТ)
			И ФормированиеФискальныхЧековСервер.ЕстьПодключенноеОборудованиеККассамОрганизации(Объект.Организация) Тогда
			
			ТекстСсылки = "ПробитьЧек";
			ТекстПредставления = Неопределено;
			Если ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.Терминал) Тогда
				ТекстПредставления = НСтр("ru = 'Принять оплату и пробить чек'");
				Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
					ТекстПредставления = НСтр("ru = 'Вернуть оплату и пробить чек'");
				КонецЕсли;
			КонецЕсли;
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиКомандуПробитьЧек(МассивПредставлений, ТекстСсылки, ТекстПредставления);
			
		ИначеЕсли СпособПроведенияПлатежа = Перечисления.СпособыПроведенияПлатежей.СистемаБыстрыхПлатежей
			И ФормированиеФискальныхЧековСервер.ЕстьПодключенноеОборудованиеККассамОрганизации(Объект.Организация) Тогда
			
			ТекстСсылки = "НастроитьОборудование";
			ТекстПредставления = Неопределено;
			ПараметрыНастройкиПодключения = ПараметрыНастройкиПодключения(Объект.ДоговорЭквайринга, Неопределено);
			Если ЗначениеЗаполнено(ПараметрыНастройкиПодключения) Тогда
				ТекстСсылки = "ПробитьЧек";
				ТекстПредставления = НСтр("ru = 'Пробить чек'");
				Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
					ТекстПредставления = НСтр("ru = 'Вернуть оплату и пробить чек'");
				КонецЕсли;			
			КонецЕсли;
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиКомандуПробитьЧек(МассивПредставлений, ТекстСсылки, ТекстПредставления);
			
		Иначе
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиСтатусЧекНеПробит(МассивПредставлений, "НастроитьОборудование");
		КонецЕсли;
		
	ИначеЕсли Объект.ОплатаВыполнена
		И ФискальнаяОперацияДанныеЖурнала = Неопределено Тогда
		
		Если ФормированиеФискальныхЧековСервер.ЕстьПодключенноеОборудованиеККассамОрганизации(Объект.Организация) Тогда
			
			ТекстСсылки = "ПробитьЧек";
			ТекстПредставления = НСтр("ru = 'Оплата принята, пробить чек'");
			Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
				ТекстПредставления = НСтр("ru = 'Оплата возвращена, пробить чек'");
			КонецЕсли;
				
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиКомандуПробитьЧек(МассивПредставлений, ТекстСсылки, ТекстПредставления);
		Иначе
			ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиСтатусЧекНеПробит(МассивПредставлений, "НастроитьОборудование");
		КонецЕсли;
		
	ИначеЕсли ФискальнаяОперацияДанныеЖурнала <> Неопределено Тогда
		
		НомерЧекаККМ = ФискальнаяОперацияДанныеЖурнала.НомерЧекаККМ;
		ТекстСсылки = "ОткрытьЗаписьФискальнойОперации";
		
		ШаблонТекстаПредставления = НСтр("ru = 'Оплата принята, пробит чек №%1'");
		Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
			ШаблонТекстаПредставления = НСтр("ru = 'Оплата возвращена, пробит чек №%1'");
		КонецЕсли;
		ТекстПредставления = СтрШаблон(ШаблонТекстаПредставления, НомерЧекаККМ);
		
		ФормированиеФискальныхЧековСервер.ДобавитьВПредставлениеГиперссылкиКомандуЧекПробит(МассивПредставлений, НомерЧекаККМ, ТекстСсылки, ТекстПредставления);
        #Вставка   
			Набор = РегистрыСведений.ФискальныеОперации.СоздатьНаборЗаписей();
			Набор.Отбор.ДокументОснование.Установить(ФискальнаяОперацияДанныеЖурнала.ДокументОснование);  
			Набор.Прочитать();  
			НадоЗаписать = Ложь;
			Для Каждого Движение Из Набор Цикл   
				Если Движение.ДокументРодитель <> Объект.Ссылка Тогда
			    	Движение.ДокументРодитель = Объект.Ссылка;     
					НадоЗаписать = Истина;
				КонецЕсли;	
			КонецЦикла;
			Если НадоЗаписать Тогда
				Набор.Записать();   
			КонецЕсли;	
		#КонецВставки
		
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура Док_ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("РасшифровкаПлатежа.СтавкаНДС");
КонецПроцедуры

#КонецОбласти
